---
published: true
layout: post
title: 暑期生活总结(感悟)
date: '2016-08-31 10:23'
categories: 生活
tags: 新市古镇 莫干山
---
我想，我总得说些什么吧，毕竟暑期一个月都过去了。感谢G20，让我可以放一个多月的假期，估计这可能是我这辈子过的最长的一个暑期了吧。这个暑期其实没有
做太多的事情，主要做了两件事儿：

 1. 去德清游玩
 2. 在家宅着搞伪科研

### 德清游玩 ###
=======

这次去德清游玩呢，是我师弟邀请去的，反正觉得论文投出去了，成都29所的事情也处理完了，而且暑期马上就开始了，于是就去了德清的新市古镇和莫干山游玩。新市古镇离德清县县城大约有30公里的路程，开车大约40多分钟就到了，算是德清县的一个副中心吧。它是典型的江南古镇风，主要是人少，而且没有过多的商业化的气息，也就是接地气吧。先看图再说。

![新市古镇]({{site.baseurl}}/assets/img/201606/IMG_20160731_193026.jpg)

![新市古镇]({{site.baseurl}}/assets/img/201606/IMG_20160731_170719.jpg)


我平时虽然说没有信奉佛教，但是对一些佛教的文化和寺庙还是比较感兴趣的，没有想到的是一个镇里面居然还有一个觉海禅寺，由于我们去的那天太晚，法师估计上晚课了，不得参观入内。

至于说莫干山嘛，看过黄山和泰山之后，我倒是觉得山上的景色一般般，所谓的剑池也就一个瀑布加上一滩水，其它的没有什么。听说是个避暑的圣地，当年蒋介石和宋美龄还在山上待过，可是我们去的那天是个大晴天，没有感觉到凉快，反而倒是觉得挺热的。这次山上旅行，让我觉得特别兴奋的可能是师弟爸爸的车技了吧，沿着开上去感觉真爽。

### 在家搞着伪科研 ###
=======

从德清回到上海之后，导师就给我打电话，说我投出去的论文有些部分可能有问题和别人做的不太一样。导师的质疑让我有些方，毕竟这个论文算是我两年以来工作的总结，显然我不会做假大空。为了证明我是对的，我不得不先后跟我的两个朋友打电话咨询，做相关实验最终使得导师信服。这里不得不提的是，我做这篇论文发现导师还真的是认真啊，而且他对学术的每一个细节都不放过，这在现在的高校里面已经很少了。于此同时也发现我们的算法模型确实有改进的地方，于是就RVPN到实验室的电脑去做相关的工作，让人可恨的是实验室的电脑总是蓝屏，让我实在没有办法，只得等着开学之后去做。

我想闲着也是闲着，看点优化知识吧，毕竟导师5月份回来的时候说我要提高自己的理论水平，不让后面不好搞。然后我就看了CMU的[Ryan Tibshirani](http://www.stat.cmu.edu/~ryantibs/) 的一些[Convex Optimization](http://www.stat.cmu.edu/~ryantibs/convexopt-S15/) 的课程。课程主要讲了关于convex set，一阶梯度下降，二阶梯度下降，subgradient method，以及dual method，Proximal gradient descent ,interior point methods 以及ADMM方法等，。interior point methods 没有讲的很清楚，其它的讲的还是比较详细的，课程的note 以及视频都有。

人嘛，总是要给自己定一个小目标的，暑期后期主要是对自己的算法模型进行相关的改进，可是把公式推导到下面的时候发现搞不动了

\begin{equation}
\begin{split}
d \mathbf{Tr }(S^TL S)=& \mathbf{Tr }(d S^TL S)\\
=& \mathbf{Tr }(S^T(L^T+L)dS)\\
=& \mathbf{Tr }(S^T(L^T+L)d[(B\bigotimes A)H])\\
\end{split}
\end{equation}

哎不得不放弃了，在quora和stackexchange上发帖了，不知道有没有人可以帮助求导。

当然暑假也遇到了一些烦心事儿，主要还是房子的事情，房东把房子卖给链家了，链家的工作人员然后开始坑房东，搞得我们房客很心烦，连续一个星期都有人上门，各种吵架真心烦人。每次看到房东赶房客这种事情，我都想能够有一套属于自己的房子该多好啊。

写在最后：暑假已经过去，马上就研究生三年级了，国庆节过后我就满24岁了，听说我妈是22岁的时候生的我哥，24岁的时候生的我，不得不觉得拉后腿了。希望研三的时候科研，生活都一切顺利吧，如果脸能够小一点那就更好了。
